Revit 2026 API

# CodeCheckingParameterServiceData Methods

---

The CodeCheckingParameterServiceData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrentElements | Returns the list of Ids of the current elements. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

CodeCheckingParameterServiceData Class

Autodesk.Revit.DB.Structure Namespace